package com.slimit.music.bean;

import java.io.Serializable;
import java.util.List;

public class OnlineMusicBean implements Serializable{
    /**
     * status : 200
     * data : [{"type":"netease","link":"http://music.163.com/#/song?id=569200213","songid":569200213,"title":"消愁","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:23.760]编曲Arranger : 赵兆\n[00:26.820]\n[00:31.660]当你走进这欢乐场\n[00:35.540]背上所有的梦与想\n[00:39.870]各色的脸上各色的妆\n[00:44.120]没人记得你的模样\n[00:46.370]\n[00:48.430]三巡酒过你在角落\n[00:52.600]固执的唱着苦涩的歌\n[00:57.000]听它在喧嚣里被淹没\n[01:01.260]你拿起酒杯对自己说\n[01:05.030]\n[01:07.550]一杯敬朝阳 一杯敬月光\n[01:11.710]唤醒我的向往 温柔了寒窗\n[01:15.580]于是可以不回头地逆风飞翔\n[01:20.310]不怕心头有雨 眼底有霜\n[01:23.070]\n[01:24.400]一杯敬故乡 一杯敬远方\n[01:28.620]守着我的善良 催着我成长\n[01:32.420]所以南北的路从此不再漫长\n[01:37.430]灵魂不再无处安放\n[01:44.370]\n[02:02.900]躁动不安的座上客\n[02:07.360]自以为是地表演着\n[02:11.600]伪装着 舞蹈着 疲惫着\n[02:15.640]你拿起酒杯对自己说\n[02:19.100]\n[02:20.180]一杯敬朝阳 一杯敬月光\n[02:24.400]唤醒我的向往 温柔了寒窗\n[02:28.240]于是可以不回头地逆风飞翔\n[02:33.100]不怕心头有雨 眼底有霜\n[02:36.840]\n[02:37.290]一杯敬故乡 一杯敬远方\n[02:41.580]守着我的善良 催着我成长\n[02:45.350]所以南北的路从此不再漫长\n[02:50.160]灵魂不再无处安放\n[02:53.010]\n[03:00.920]一杯敬明天 一杯敬过往\n[03:05.170]支撑我的身体 厚重了肩膀\n[03:08.910]虽然从不相信所谓山高水长\n[03:13.650]人生苦短何必念念不忘\n[03:15.870]\n[03:18.100]一杯敬自由 一杯敬死亡\n[03:22.210]宽恕我的平凡 驱散了迷惘\n[03:26.000]好吧天亮之后总是潦草离场\n[03:30.840]清醒的人最荒唐\n[03:37.360]清醒的人最荒唐\n[03:44.430]\n[03:46.680]制作人Producer : 李健 赵兆\n[03:48.130]手风琴Accordion : 许笑男\n[03:50.660]键盘Keyboard : 赵兆\n[03:52.300]吉他Guitar : 薛峰\n[03:53.860]贝斯Bass : 韩阳\n[03:55.550]鼓Drum : 武勇恒\n[03:57.300]合音Backing Vocal : 梁古驰\n[03:58.920]弦乐Strings : 国际首席爱乐乐团International Master Philharmonic Orchestra\n[04:00.460]混音Mixing : 李游\n[04:02.050]母带Mastering : Joe LaPorta .（Sterling Sound. NY）\n[04:03.600]录音棚Studio : 55TEC . Beijing\n[04:05.050]录音Recording : 李游 李杨\n[04:06.340]人声录音Vocal Recording : 李杨\n[04:07.470]人声编辑Vocal Editing : 李杨\n[04:08.650]录音助理Recording Assistants : 郭舒文 邢铜\n[04:10.150]音乐制作发行produced and distributed : 哇唧唧哇×智慧大狗\n[04:11.680]\n","url":"http://music.163.com/song/media/outer/url?id=569200213.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569214247","songid":569214247,"title":"平凡的一天","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:03.660]编曲Arranger : 赵兆\n[00:04.100]\n[00:14.470]每个早晨七点半就自然醒\n[00:22.390]风铃响起又是一天云很轻\n[00:30.280]晒好的衣服味道很安心\n[00:36.830]一切都是柔软又宁静\n[00:44.930]每个路口花都开在阳光里\n[00:52.660]小店门前传来好听的恋曲\n[01:00.390]不用太久就能走到目的地\n[01:07.820]人来人往里满是善意\n[01:15.100]这是最平凡的一天啊\n[01:19.610]你也想念吗\n[01:23.120]不追不赶慢慢走回家\n[01:29.750]就这样虚度着年华 没牵挂\n[01:38.300]只有晚风轻拂着脸颊\n[02:02.170]日落之前斜阳融在小河里\n[02:08.650]逛了黄昏市场收获很满意\n[02:16.000]朋友打来电话说他在等你\n[02:23.980]见面有聊不完的话题\n[02:31.390]餐桌摆在开满花的院子里\n[02:39.580]微微酒意阵阵欢歌笑语\n[02:47.330]从不考虑明天应该去哪里\n[02:54.990]因为今夜的风太和煦\n[03:01.380]这是最平凡的一天啊\n[03:06.220]你也想念吗\n[03:09.900]不追不赶慢慢走回家\n[03:16.520]就这样虚度着年华 没牵挂\n[03:25.100]只有晚风轻拂着脸颊\n[03:31.990]这是最完美的一天啊\n[03:36.720]你也想要吗\n[03:40.470]生活可以不那么复杂\n[03:46.700]就这样虚度着年华 没牵挂\n[03:55.680]只有晚风轻拂着脸颊\n[04:02.940]总有一天 我们会找到她\n[04:15.940]\n[04:23.110]制作人Producer : 李健 赵兆\n[04:23.340]键盘Keyboard : 赵兆\n[04:23.550]吉他Guitar : 向嵬\n[04:23.730]贝斯Bass : 韩阳\n[04:23.900]鼓Drum : 武勇恒\n[04:24.100]长笛flute : 刘晓光\n[04:24.290]合音Backing Vocal : 梁古驰\n[04:24.450]混音Mixing : 李游\n[04:24.630]母带Mastering : Joe LaPorta .（Sterling Sound. NY）\n[04:24.830]录音棚Studio : 55TEC . Beijing\n[04:24.990]录音Recording : 李游 李杨\n[04:25.290]人声录音Vocal Recording : 李杨\n[04:25.440]人声编辑Vocal Editing : 李杨\n[04:25.690]录音助理Recording Assistants : 郭舒文 邢铜\n[04:26.110]音乐制作发行Produced and Distributed : 哇唧唧哇×智慧大狗\n[04:26.780]\n","url":"http://music.163.com/song/media/outer/url?id=569214247.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569213220","songid":569213220,"title":"像我这样的人","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:09.340]编曲Arranger : 赵兆 宋涛\n[00:09.840]\n[00:15.000]像我这样优秀的人\n[00:18.770]本该灿烂过一生\n[00:22.620]怎么二十多年到头来\n[00:26.700]还在人海里浮沉\n[00:30.240]\n[00:30.350]像我这样聪明的人\n[00:34.500]早就告别了单纯\n[00:38.380]怎么还是用了一段情\n[00:42.360]去换一身伤痕\n[00:44.680]\n[00:46.150]像我这样迷茫的人\n[00:49.840]像我这样寻找的人\n[00:53.800]像我这样碌碌无为的人\n[00:57.590]你还见过多少人\n[01:06.910]\n[01:18.640]像我这样庸俗的人\n[01:22.830]从不喜欢装深沉\n[01:26.540]怎么偶尔听到老歌时\n[01:30.620]忽然也晃了神\n[01:34.380]像我这样懦弱的人\n[01:38.240]凡事都要留几分\n[01:42.200]怎么曾经也会为了谁\n[01:45.950]想过奋不顾身\n[01:47.680]\n[01:49.870]像我这样迷茫的人\n[01:53.770]像我这样寻找的人\n[01:57.490]像我这样碌碌无为的人\n[02:01.450]你还见过多少人\n[02:04.690]\n[02:05.460]像我这样孤单的人\n[02:09.200]像我这样傻的人\n[02:13.260]像我这样不甘平凡的人\n[02:16.990]世界上有多少人\n[02:20.080]\n[02:26.760]像我这样迷茫的人\n[02:30.510]像我这样寻找的人\n[02:34.370]像我这样碌碌无为的人\n[02:38.230]你还见过多少人\n[02:40.340]\n[02:42.000]像我这样孤单的人\n[02:46.100]像我这样傻的人\n[02:49.970]像我这样不甘平凡的人\n[02:53.650]世界上有多少人\n[02:56.630]\n[02:59.630]像我这样莫名其妙的人\n[03:05.430]会不会有人心疼\n[03:09.550]\n[03:13.900]制作人Producer : 李健 赵兆\n[03:14.760]口琴Harmonica : 刘晓光\n[03:15.820]键盘Keyboard : 赵兆\n[03:16.790]吉他Guitar : 薛峰\n[03:17.610]贝斯Bass : 韩阳\n[03:18.600]鼓Drum : 武勇恒\n[03:19.370]弦乐Strings : 国际首席爱乐乐团International Master Philharmonic Orchestra\n[03:20.230]混音Mixing : 周天澈\n[03:21.190]母带Mastering : Joe LaPorta .（Sterling Sound. NY）\n[03:21.880]录音棚Studio : 55TEC . Beijing\n[03:22.690]录音Recording : 李游 李杨\n[03:23.380]人声录音Vocal Recording : 李杨\n[03:24.100]人声编辑Vocal Editing : 李杨\n[03:24.670]录音助理Recording Assistants : 郭舒文 邢铜\n[03:25.260]音乐制作发行produced and distributed : 哇唧唧哇×智慧大狗\n[03:25.940]\n","url":"http://music.163.com/song/media/outer/url?id=569213220.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=525278524","songid":525278524,"title":"无问","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:00.347] 作词 : 毛不易\n[00:01.43]编曲：刘卓\n[00:19.93]你问风为什么托着候鸟飞翔\n[00:25.27]却又吹的让他慌张\n[00:29.69]你问雨为什么滋养万物生长\n[00:35.25]却也湿透他的衣裳\n[00:39.66]你问他为什么亲吻他的伤疤\n[00:45.20]却又不能带他回家\n[00:50.50]你问我为什么还是不敢放下\n[00:55.18]明知听不到回答\n[00:59.87]如果光已忘了要将前方照亮\n[01:05.14]你会握着我的手吗\n[01:10.10]如果路会通往不知名的地方\n[01:15.15]你会跟我一起走吗\n[01:19.56]一生太短 一瞬好长\n[01:24.53]我们哭着醒来 又哭着遗忘\n[01:30.14]幸好啊 你的手曾落在我肩膀\n[01:39.30]就像空中漂浮的\n[01:42.21]渺小的 某颗尘土\n[01:49.88]它到底 为什么 为什么\n[01:54.33]不肯停驻\n[02:00.19]直到乌云散去 风雨落幕\n[02:10.37]他会带你找到 光的来处\n[02:19.63]就像手边落满了\n[02:22.18]灰尘的 某一本书\n[02:29.96]它可曾 单薄地\n[02:32.12]承载了 谁的酸楚\n[02:40.23]尽管岁月无声 流向迟暮\n[02:50.26]他会让你想起 你的归途\n[03:44.95]如果光已忘了要将前方照亮\n[03:50.72]你会握着我的手吗\n[03:55.92]如果路会通往不知名的地方\n[04:01.38]你会跟我一起走吗\n[04:12.38]\n[04:13.38]制作人：刘卓\n[04:14.38]混音：周天澈\n[04:15.38]配唱制作人：刘芳\n[04:16.38]弦乐编写：靳锐\n[04:17.38]弦乐录音：国际首席爱乐乐团 首席 李朋\n[04:18.38]\n","url":"http://music.163.com/song/media/outer/url?id=525278524.mp3","pic":"http://p1.music.126.net/SJLDel776uY6MEKEU5GbjA==/109951163099854364.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=536099160","songid":536099160,"title":"不染","author":"毛不易","lrc":"[00:00.00] 作曲 : 简弘亦\n[00:01.00] 作词 : 海雷\n[00:19.87]编曲：丁培峰\n[00:39.95]不愿染是与非 怎料事与愿违\n[00:46.83]心中的花枯萎 时光它去不回\n[00:53.83]但愿洗去浮华 掸去一身尘灰\n[01:00.79]再与你一壶清酒 话一世沉醉\n[01:08.19]不愿染是与非 怎料事与愿违\n[01:14.97]心中的花枯萎 时光它去不回\n[01:22.14]回忆辗转来回 痛不过这心扉\n[01:29.20]愿只愿余生无悔 随花香远飞\n[01:36.65]一壶清酒 一身尘灰\n[01:43.45]一念来回度余生无悔\n[01:50.65]一场春秋 生生灭灭 浮华是非\n[01:57.81]待花开之时再醉一回\n[02:32.97]不愿染是与非 怎料事与愿违\n[02:39.61]心中的花枯萎 时光它去不回\n[02:46.80]回忆辗转来回 痛不过这心扉\n[02:53.84]愿只愿余生无悔 随花香远飞\n[03:01.40]一壶清酒 一身尘灰\n[03:08.45]一念来回度余生无悔\n[03:15.39]一场春秋 生生灭灭 浮华是非\n[03:22.37]待花开之时再醉一回\n[03:29.56]愿这生生的时光不再枯萎 待花开之时再醉一回\n[03:43.63]愿这生生的时光不再枯萎 再回首浅尝心酒余味\n[03:58.14]一壶清酒 一身尘灰\n[04:04.84]一念来回度余生无悔\n[04:11.86]一场春秋 生生灭灭 浮华是非\n[04:18.91]待花开之时再醉一回\n[04:26.23]一壶清酒 一身尘灰\n[04:33.09]一念来回度余生无悔\n[04:40.13]一场回忆 生生灭灭 了了心扉\n[04:47.12]再回首浅尝心酒余味\n[04:54.34]一场回忆 生生灭灭 了了心扉\n[05:01.39]再回首浅尝心酒余味\n[05:08.93]\n[05:09.62] 制作人：萨顶顶\n[05:10.12]监制：付宏声\n[05:10.51]和声、弦乐编写：丁培峰\n[05:10.99]吉他：王晓松\n[05:11.51]贝斯：王晓松\n[05:12.10]笛子：赵雪\n[05:12.55]弦乐：国际首席爱乐乐团\n[05:13.10]和声：高莹 王勖\n[05:13.55]录音师：李牧野\n[05:13.95]录音棚：CU Music中英音乐\n[05:14.35]混音师：李牧野\n[05:14.81]混音录音棚：CU Music中英音乐\n[05:15.23]音乐制作出品：中英音乐\n[05:15.62]音乐发行：智慧大狗x天才联盟\n[05:15.95]统筹：张葛 王明宇\n","url":"http://music.163.com/song/media/outer/url?id=536099160.mp3","pic":"http://p1.music.126.net/oSpn_9Y4xVPMRTZpbNkIkQ==/109951163425510614.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569214252","songid":569214252,"title":"如果有一天我变得很有钱","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:00.460] 作词 : 毛不易\n[00:01.380]编曲Arranger : 赵兆\n[00:03.600]\n[00:13.000]如果有一天我变得很有钱\n[00:16.000]我的第一选择不是去环游世界\n[00:19.510]躺在世界上最大最软的沙发里\n[00:22.870]吃了就睡醒了再吃先过一年\n[00:25.820]\n[00:26.520]如果有一天我变得很有钱\n[00:29.240]就可以把所有人都留在我身边\n[00:32.710]每天快快乐乐吃吃喝喝聊聊天\n[00:36.410]不用担心关于明天或离别\n[00:40.470]\n[00:42.490]变有钱 我变有钱\n[00:46.490]多少人没日没夜地浪费时间\n[00:49.490]变有钱 我变有钱\n[00:53.350]然后故作谦虚地说金钱不是一切\n[01:02.800]\n[01:10.500]如果有一天我变得很有钱\n[01:13.470]我会买下所有难得一见的笑脸\n[01:16.770]让所有可怜的孩子不再胆怯\n[01:20.220]所有邪恶的人不再掌握话语权\n[01:23.310]\n[01:23.750]如果有一天我变得很有钱\n[01:26.790]我会想尽一切办法倒流时间\n[01:30.130]不是为了人类理想做贡献\n[01:33.520]只是想和她说一句我很抱歉\n[01:37.920]\n[01:40.100]变有钱 我变有钱\n[01:43.720]多少人没日没夜地浪费时间\n[01:47.100]变有钱 我变有钱\n[01:51.000]然后故作谦虚的说金钱不是一切\n[01:55.220]\n[01:55.570]我变有钱\n[01:57.290]所有烦恼都被留在天边\n[02:00.530]变有钱 我变有钱\n[02:04.520]然后发自内心地说金钱它不是一切\n[02:10.820]\n[02:20.810]变有钱 我变有钱\n[02:24.630]多少人没日没夜地浪费时间\n[02:27.540]变有钱 我变有钱\n[02:31.680]然后故作谦虚的说金钱不是一切\n[02:35.080]\n[02:35.470]我变有钱\n[02:37.930]所有烦恼都被留在天边\n[02:41.000]变有钱 我变有钱\n[02:44.640]然后发自内心地说金钱它不是一切\n[02:47.600]\n[02:47.700]制作人Producer : 李健 赵兆\n[02:47.800]键盘Keyboard : 赵兆\n[02:47.900]吉他Guitar : 薛峰\n[02:48.000]贝斯Bass : 韩阳\n[02:48.150]鼓Drum : 武勇恒\n[02:48.250]合音Backing Vocal : 赵兆 梁古驰\n[02:48.350]混音Mixing : 李游\n[02:48.450]母带Mastering : Joe LaPorta .（Sterling Sound. NY）\n[02:48.550]录音棚Studio : 55TEC . Beijing\n[02:48.650]录音Recording : 李游 李杨\n[02:49.750]人声录音Vocal Recording : 李杨\n[02:49.850]人声编辑Vocal Editing : 李杨\n[02:49.950]录音助理Recording Assistants : 郭舒文 邢铜\n[02:50.000]音乐制作发行produced and distributed : 哇唧唧哇×智慧大狗\n","url":"http://music.163.com/song/media/outer/url?id=569214252.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569212211","songid":569212211,"title":"盛夏","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:12.290]编曲Arranger : 赵兆 宋涛\n[00:13.310]\n[00:30.000]那是日落时候轻轻发出的叹息啊\n[00:37.850]昨天已经走远了 明天该去哪啊\n[00:45.620]相框里的那些闪闪发光的我们啊\n[00:53.420]在夏天发生的事 你忘了吗\n[01:01.420]铁道旁的老树下 几只乌鸦\n[01:09.440]叫到嗓音沙哑 却再没人回答\n[01:17.340]火车呼啸着驶过 驶过寂寞或繁华\n[01:24.400]曾经年轻的人啊 也想我吗\n[01:33.320]就回来吧 回来吧 有人在等你呢\n[01:41.160]有人在等你说完那句说一半的话\n[01:48.760]就别走了 留下吧 外面它太复杂\n[01:57.340]多少次让你热泪盈眶却不敢流下\n[02:26.970]铁道旁的老树下 几只乌鸦\n[02:34.740]叫到嗓音沙哑 却再没人回答\n[02:42.670]火车呼啸着驶过 驶过寂寞或繁华\n[02:49.380]曾经年轻的人啊 也会想我吗\n[02:58.360]就回来吧 回来吧 有人在等你呢\n[03:07.100]有人在等你说完那句说一半的话\n[03:13.910]就别走了 留下吧 外面它太复杂\n[03:22.470]多少次让你热泪盈眶却不敢流下\n[03:41.000]可时光啊 不听话 总催着人长大\n[03:49.620]这一站到下一站旅途总是停不下\n[03:56.500]就慢慢的 忘了吧 因为回不去啊\n[04:05.130]这闭上眼睛就拥有了一切的盛夏\n[04:19.140]\n[04:19.910]制作人Producer : 李健 赵兆\n[04:20.250]键盘Keyboard : 赵兆\n[04:20.490]吉他Guitar : 薛峰\n[04:20.850]贝斯Bass : 韩阳\n[04:21.180]鼓Drum : 武勇恒\n[04:21.460]弦乐Strings : 国际首席爱乐乐团International Master Philharmonic Orchestra\n[04:21.770]混音Mixing : 周天澈\n[04:22.130]母带Mastering : Joe LaPorta .（Sterling Sound. NY）\n[04:22.510]录音棚Studio : 55TEC . Beijing\n[04:22.830]录音Recording : 李游 李杨\n[04:23.190]人声录音Vocal Recording : 李杨\n[04:23.570]人声编辑Vocal Editing : 李杨\n[04:23.930]录音助理Recording Assistants : 郭舒文 邢铜\n[04:24.320]音乐制作发行Produced and Distributed : 哇唧唧哇×智慧大狗\n[04:25.710]\n","url":"http://music.163.com/song/media/outer/url?id=569212211.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569214250","songid":569214250,"title":"借","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:11.37]编曲Arranger ：赵兆 宋涛\n[00:12.11]\n[00:25.41]借一盏午夜街头 昏黄灯光\n[00:31.16]照亮那坎坷路上人影一双\n[00:37.43]借一寸三九天里 冽冽暖阳\n[00:43.80]融这茫茫人间刺骨凉\n[00:50.41]借一泓古老河水 九曲回肠\n[00:56.43]带着那摇晃烛火 漂往远方\n[01:02.74]借一段往日旋律 婉转悠扬\n[01:08.94]把这不能说的轻轻唱\n[01:15.54]被这风吹散的人说他爱得不深\n[01:22.24]被这雨淋湿的人说他不会冷\n[01:28.15]无边夜色到底还要蒙住多少人\n[01:35.49]它写进眼里 他不敢承认\n[02:06.58]借一抹临别黄昏悠悠斜阳\n[02:12.37]为这漫漫余生添一道光\n[02:18.63]借一句刻骨铭心来日方长\n[02:25.26]倘若不得不天各一方\n[02:31.26]被这风吹散的人说他爱得不深\n[02:37.94]被这雨淋湿的人说他不会冷\n[02:43.79]无边夜色到底还要蒙住多少人\n[02:51.21]它写进眼里 他不敢承认\n[02:56.91]可是啊 总有那风吹不散的认真\n[03:03.45]总有大雨也不能抹去的泪痕\n[03:09.04]有一天太阳会升起在某个清晨\n[03:20.01]一道彩虹 两个人\n[03:28.53]借一方乐土让他容身\n[03:35.94]借他平凡一生\n[03:43.44]\n[03:44.08]制作人Producer：李健 赵兆\n[03:44.51]键盘Keyboard：赵兆\n[03:44.87]吉他Guitar：薛峰\n[03:45.25]贝斯Bass：韩阳\n[03:45.65]鼓Drum：武勇恒\n[03:46.08]弦乐Strings：国际首席爱乐乐团International Master Philharmonic Orchestra\n[03:46.49]混音Mixing：李游\n[03:46.96]母带Mastering：Joe LaPorta .（Sterling Sound. NY）\n[03:47.40]录音棚Studio：55TEC . Beijing\n[03:47.85]录音Recording：李游 李杨\n[03:48.33]人声录音Vocal Recording：李杨\n[03:48.80]人声编辑Vocal Editing：李杨\n[03:49.27]录音助理Recording Assistants：郭舒文 邢铜\n[03:49.79]音乐制作发行produced and distributed: 哇唧唧哇×智慧大狗\n[03:50.39]\n","url":"http://music.163.com/song/media/outer/url?id=569214250.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=524913480","songid":524913480,"title":"感觉自己是巨星","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:00.349] 作词 : 毛不易\n[00:01.48]编曲/混音/母带：张玄\n[00:01.88]制作人：TNK\n[00:02.06]吉他：王京伟/董斌\n[00:02.39]监唱/和声编写：鲍鱼\n[00:03.13]\n[00:16.12]有时候我感觉自己是一个巨星\n[00:19.57]\n[00:20.25]每个人都爱着我有钱又有名\n[00:24.38]所以每当生活让我想死的时候\n[00:28.20]\n[00:28.73]对自己说巨星只是在扮演平民\n[00:32.91]有时候我感觉自己是一个巨星\n[00:37.08]年轻貌美有才华用也用不尽\n[00:41.38]所以当我走到一筹莫展的时候\n[00:45.19]\n[00:45.70]只是巨星需要休息\n[00:49.28]\n[00:50.03]巨星啊巨星我们爱你\n[00:54.13]少了你生活就不能继续\n[00:58.46]为了让粉丝们活下去\n[01:02.67]你要好好照顾自己\n[01:06.28]\n[01:06.91]巨星啊巨星我们支持你\n[01:11.15]支持你做的所有决定\n[01:15.40]大胆做自己别犹豫\n[01:19.72]巨星永远有人气\n[01:23.42]\n[01:41.01]有时候我感觉自己是一个巨星\n[01:45.21]每天各大时尚 party 出席个不停\n[01:49.34]所以当我偶尔觉得孤单的时候\n[01:53.63]离开人群假装很庆幸\n[01:57.00]\n[01:57.82]巨星啊巨星我们爱你\n[02:02.16]少了你生活就不能继续\n[02:06.44]为了让粉丝们活下去\n[02:10.71]你要好好照顾自己\n[02:14.78]巨星啊巨星我们支持你\n[02:19.16]支持你做的所有决定\n[02:23.41]大胆做自己别犹豫\n[02:27.68]巨星永远有人气\n[02:31.23]\n[02:31.89]希望你也感觉自己是一个巨星\n[02:36.14]这样活着也许就能有点乐趣\n[02:40.37]如果你个人没有很想当巨星\n[02:44.66]想当什么都可以\n","url":"http://music.163.com/song/media/outer/url?id=524913480.mp3","pic":"http://p1.music.126.net/FxEWcGgScnTtO2BrA8d9WA==/109951163087827546.jpg?param=300x300"},{"type":"netease","link":"http://music.163.com/#/song?id=569200212","songid":569200212,"title":"一荤一素","author":"毛不易","lrc":"[00:00.00] 作曲 : 毛不易\n[00:01.00] 作词 : 毛不易\n[00:09.00]编曲Arranger ：赵兆 宋涛\n[00:11.69]\n[00:27.25]日出又日落 深处再深处\n[00:34.19]一张小方桌 有一荤一素\n[00:40.90]一个身影从容地忙忙碌碌\n[00:47.55]一双手让这时光有了温度\n[00:50.91]\n[00:54.76]太年轻的人 他总是不满足\n[01:01.67]固执地不愿停下 远行的脚步\n[01:08.10]望着高高的天走了长长的路\n[01:15.49]忘了回头看 她有没有哭\n[01:19.11]\n[01:26.17]月儿明 风儿轻\n[01:31.53]可是你在敲打我的窗棂\n[01:38.49]听到这儿你就别担心\n[01:45.17]其实我过的还可以\n[01:48.62]\n[01:51.78]月儿明 风儿轻\n[01:57.46]你又可曾来过我的梦里\n[02:04.74]一定是你来时太小心\n[02:10.45]知道我睡得轻\n[02:13.16]\n[02:43.94]太年轻的人 他总是不满足\n[02:49.93]固执地不愿停下 远行的脚步\n[02:55.87]望着高高的天走了长长的路\n[03:03.28]忘了回头看 她有没有哭\n[03:05.08]\n[03:09.55]月儿明 风儿轻\n[03:15.25]可是你在敲打我的窗棂\n[03:22.39]听到这儿你就别担心\n[03:29.17]其实我过的还可以\n[03:31.18]\n[03:35.26]月儿明 风儿轻\n[03:41.26]你又可曾来过我的梦里\n[03:48.53]一定是你来时太小心\n[03:53.99]知道我睡得轻\n[03:58.62]\n[04:02.02]一定是你来时太小心\n[04:09.65]怕我再想起你\n[04:15.70]\n[04:16.72]\n[04:17.82]制作人Producer：李健 赵兆\n[04:19.01]键盘Keyboard：宋涛\n[04:20.35]吉他Guitar：薛峰\n[04:21.46]贝斯Bass：韩阳\n[04:22.48]合音Backing Vocal：赵兆\n[04:23.49]黑管Clarinet：李为\n[04:24.66]弦乐Strings：国际首席爱乐乐团International Master Philharmonic Orchestra\n[04:26.27]混音Mixing：李游\n[04:27.31]母带Mastering：Joe LaPorta .（Sterling Sound. NY）\n[04:28.07]录音棚Studio：55TEC . Beijing\n[04:28.91]录音Recording：李游 李杨\n[04:29.65]人声录音Vocal Recording：李杨\n[04:30.39]人声编辑Vocal Editing：李杨\n[04:31.11]录音助理Recording Assistants：郭舒文 邢铜\n[04:31.69]音乐制作发行produced and distributed: 哇唧唧哇×智慧大狗\n[04:32.81]\n","url":"http://music.163.com/song/media/outer/url?id=569200212.mp3","pic":"http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300"}]
     */

    private int status;
    private List<DataBean> data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean implements Serializable{
        /**
         * type : netease
         * link : http://music.163.com/#/song?id=569200213
         * songid : 569200213
         * title : 消愁
         * author : 毛不易
         * lrc : [00:00.00] 作曲 : 毛不易
         [00:01.00] 作词 : 毛不易
         [00:23.760]编曲Arranger : 赵兆
         [00:26.820]
         [00:31.660]当你走进这欢乐场
         [00:35.540]背上所有的梦与想
         [00:39.870]各色的脸上各色的妆
         [00:44.120]没人记得你的模样
         [00:46.370]
         [00:48.430]三巡酒过你在角落
         [00:52.600]固执的唱着苦涩的歌
         [00:57.000]听它在喧嚣里被淹没
         [01:01.260]你拿起酒杯对自己说
         [01:05.030]
         [01:07.550]一杯敬朝阳 一杯敬月光
         [01:11.710]唤醒我的向往 温柔了寒窗
         [01:15.580]于是可以不回头地逆风飞翔
         [01:20.310]不怕心头有雨 眼底有霜
         [01:23.070]
         [01:24.400]一杯敬故乡 一杯敬远方
         [01:28.620]守着我的善良 催着我成长
         [01:32.420]所以南北的路从此不再漫长
         [01:37.430]灵魂不再无处安放
         [01:44.370]
         [02:02.900]躁动不安的座上客
         [02:07.360]自以为是地表演着
         [02:11.600]伪装着 舞蹈着 疲惫着
         [02:15.640]你拿起酒杯对自己说
         [02:19.100]
         [02:20.180]一杯敬朝阳 一杯敬月光
         [02:24.400]唤醒我的向往 温柔了寒窗
         [02:28.240]于是可以不回头地逆风飞翔
         [02:33.100]不怕心头有雨 眼底有霜
         [02:36.840]
         [02:37.290]一杯敬故乡 一杯敬远方
         [02:41.580]守着我的善良 催着我成长
         [02:45.350]所以南北的路从此不再漫长
         [02:50.160]灵魂不再无处安放
         [02:53.010]
         [03:00.920]一杯敬明天 一杯敬过往
         [03:05.170]支撑我的身体 厚重了肩膀
         [03:08.910]虽然从不相信所谓山高水长
         [03:13.650]人生苦短何必念念不忘
         [03:15.870]
         [03:18.100]一杯敬自由 一杯敬死亡
         [03:22.210]宽恕我的平凡 驱散了迷惘
         [03:26.000]好吧天亮之后总是潦草离场
         [03:30.840]清醒的人最荒唐
         [03:37.360]清醒的人最荒唐
         [03:44.430]
         [03:46.680]制作人Producer : 李健 赵兆
         [03:48.130]手风琴Accordion : 许笑男
         [03:50.660]键盘Keyboard : 赵兆
         [03:52.300]吉他Guitar : 薛峰
         [03:53.860]贝斯Bass : 韩阳
         [03:55.550]鼓Drum : 武勇恒
         [03:57.300]合音Backing Vocal : 梁古驰
         [03:58.920]弦乐Strings : 国际首席爱乐乐团International Master Philharmonic Orchestra
         [04:00.460]混音Mixing : 李游
         [04:02.050]母带Mastering : Joe LaPorta .（Sterling Sound. NY）
         [04:03.600]录音棚Studio : 55TEC . Beijing
         [04:05.050]录音Recording : 李游 李杨
         [04:06.340]人声录音Vocal Recording : 李杨
         [04:07.470]人声编辑Vocal Editing : 李杨
         [04:08.650]录音助理Recording Assistants : 郭舒文 邢铜
         [04:10.150]音乐制作发行produced and distributed : 哇唧唧哇×智慧大狗
         [04:11.680]

         * url : http://music.163.com/song/media/outer/url?id=569200213.mp3
         * pic : http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?param=300x300
         */

        private String type;
        private String link;
        private String songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getSongid() {
            return songid;
        }

        public void setSongid(String songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }
    }
}
