package com.slimit.music.bean;

import java.util.List;

public class QQBean {

    /**
     * status : 200
     * data : [{"type":"qq","link":"http://y.qq.com/n/yqq/song/003kLvu04bLGzi.html","songid":"003kLvu04bLGzi","title":"消愁 (Live)","author":"毛不易","lrc":"[ti:消愁 (Live)]\n[ar:毛不易]\n[al:明日之子 第7期]\n[by:]\n[offset:0]\n[00:00.22]消愁 (Live) - 毛不易\n[00:01.74]词：毛不易\n[00:02.67]曲：毛不易\n[00:03.84]编曲：郑楠\n[00:04.00]音乐总监：谭伊哲\n[00:05.58]乐队：TYZ乐队\n[00:07.11]\n[00:18.19]当你走进这欢乐场\n[00:22.24]背上所有的梦与想\n[00:26.09]\n[00:26.64]各色的脸上各色的妆\n[00:30.95]没人记得你的模样\n[00:35.31]三巡酒过你在角落\n[00:39.71]固执地唱着苦涩的歌\n[00:43.99]听他在喧嚣里被淹没\n[00:48.14]你拿起酒杯对自己说\n[00:52.78]一杯敬朝阳 一杯敬月光\n[00:57.17]唤醒我的向往 温柔了寒窗\n[01:01.17]于是可以不回头地逆风飞翔\n[01:05.84]不怕心头有雨 眼底有霜\n[01:10.36]一杯敬故乡 一杯敬远方\n[01:14.66]守着我的善良 催着我成长\n[01:18.58]所以南北的路从此不再漫长\n[01:23.23]灵魂不再无处安放\n[01:26.83]\n[01:47.69]一杯敬明天 一杯敬过往\n[01:51.81]宽重我的身体 厚重了肩膀\n[01:55.67]虽然从不相信所谓山高水长\n[02:00.39]人生苦短何必念念不忘\n[02:04.77]一杯敬自由 一杯敬死亡\n[02:09.10]宽恕我的平凡 驱散了迷惘\n[02:13.20]好吧天亮之后总是潦草离场\n[02:17.57]清醒的人最荒唐\n[02:21.20]\n[02:21.80]好吧天亮之后总是潦草离场\n[02:26.45]清醒的人最荒唐","url":"http://dl.stream.qqmusic.qq.com/M800003kLvu04bLGzi.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002xoonH2Bk7FR.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0015sP7W3Vl8cN.html","songid":"0015sP7W3Vl8cN","title":"像我这样的人 (Live)","author":"毛不易","lrc":"[ti:像我这样的人 (Live)]\n[ar:毛不易]\n[al:2017阅文超级IP风云盛典]\n[by:]\n[offset:0]\n[00:00.55]像我这样的人 (2017阅文超级IP风云盛典) (Live) - 毛不易\n[00:02.39]词：毛不易\n[00:03.12]曲：毛不易\n[00:04.32]\n[00:15.63]像我这样优秀的人\n[00:17.85]\n[00:19.39]本该灿烂过一生\n[00:21.75]\n[00:23.45]怎么二十多年到头来\n[00:26.64]\n[00:27.27]还在人海里浮沉\n[00:29.72]\n[00:31.11]像我这样聪明的人\n[00:33.43]\n[00:34.88]早就告别了单纯\n[00:37.45]\n[00:38.93]怎么还是用了一段情\n[00:41.87]\n[00:42.69]去换一身伤痕\n[00:45.26]\n[00:46.59]像我这样迷茫的人\n[00:49.28]\n[00:50.36]像我这样寻找的人\n[00:53.19]\n[00:54.28]像我这样碌碌无为的人\n[00:57.70]\n[00:58.29]你还见过多少人\n[01:00.75]\n[01:21.43]像我这样庸俗的人\n[01:23.94]\n[01:25.15]从不喜欢装深沉\n[01:27.91]\n[01:29.11]怎么偶尔听到老歌时\n[01:32.23]\n[01:33.10]忽然也晃了神\n[01:35.52]\n[01:36.84]像我这样懦弱的人\n[01:39.27]\n[01:40.76]凡事都要留几分\n[01:43.05]\n[01:44.55]怎么曾经也会为了谁\n[01:47.60]\n[01:48.45]想过奋不顾身\n[01:50.97]\n[01:52.33]像我这样迷茫的人\n[01:55.09]\n[01:56.25]像我这样寻找的人\n[01:58.82]\n[02:00.10]像我这样碌碌无为的人\n[02:03.18]\n[02:03.96]你还见过多少人\n[02:06.56]\n[02:07.81]像我这样孤单的人\n[02:10.62]\n[02:11.55]像我这样傻的人\n[02:14.23]\n[02:15.54]像我这样不甘平凡的人\n[02:18.60]\n[02:19.42]世界上有多少人\n[02:21.82]\n[02:25.26]像我这样莫名其妙的人\n[02:28.65]\n[02:29.55]会不会有人心疼","url":"http://dl.stream.qqmusic.qq.com/M8000015sP7W3Vl8cN.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000004UVsoZ3ARwpl.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/000uhMwj387EBp.html","songid":"000uhMwj387EBp","title":"牧马城市","author":"毛不易","lrc":"[ti:牧马城市 (《老男孩》电视剧片尾曲)]\n[ar:毛不易]\n[al:牧马城市]\n[by:]\n[offset:0]\n[00:00.24]牧马城市 (《老男孩》电视剧片尾曲) - 毛不易\n[00:01.71]词：段思思\n[00:02.40]曲：谭旋\n[00:02.55]编曲：蔡科俊\n[00:02.77]制作人：谭旋\n[00:02.99]吉他：蔡科俊\n[00:03.21]贝斯：蔡科俊\n[00:03.43]弦乐：国际首席爱乐乐团\n[00:03.83]录音：谭旋\n[00:04.02]混音：周天澈\n[00:04.24]和声：曾缔\n[00:04.42]录音棚：谭旋音乐工作室\n[00:04.83]出品：上海谭旋音乐工作室\n[00:05.46]\n[00:31.66]游历在大街和楼房\n[00:34.57]心中是骏马和猎场\n[00:37.67]最了不起的脆弱迷惘\n[00:41.08]不过就这样\n[00:43.65]\n[00:44.34]天外有天有无常\n[00:47.30]山外有山有他乡\n[00:50.41]跌了撞了 心还是回老地方\n[00:54.95]\n[00:56.87]游离于城市的痛痒\n[00:59.79]错过了心爱的姑娘\n[01:02.92]宣告世界的那个理想\n[01:06.27]已不知去向\n[01:09.36]为所欲为是轻狂\n[01:12.33]防不胜防是悲伤\n[01:15.65]后来才把成熟当偏方\n[01:20.40]\n[01:21.57]当所有想的说的要的爱的\n[01:25.17]都挤在心脏\n[01:27.68]\n[01:28.39]行李箱里装不下我 想去的远方\n[01:33.99]\n[01:34.53]这来的去的给的欠的 算一种褒奖\n[01:40.06]\n[01:40.74]风吹草低见惆怅 抬头至少还有光\n[01:45.90]\n[02:12.67]游历在大街和楼房\n[02:15.58]心中是骏马和猎场\n[02:18.77]最了不起的脆弱迷惘\n[02:22.11]不过就这样\n[02:24.99]天外有天有无常\n[02:28.19]山外有山有他乡\n[02:31.49]跌了撞了 心还是回老地方\n[02:36.21]\n[02:37.88]游离于城市的痛痒\n[02:40.85]错过了心爱的姑娘\n[02:44.03]宣告世界的那个理想\n[02:47.34]已不知去向\n[02:49.80]\n[02:50.57]为所欲为是轻狂\n[02:53.60]防不胜防是悲伤\n[02:56.79]后来才把成熟当偏方\n[03:01.94]\n[03:02.60]当所有想的说的要的爱的\n[03:06.32]都挤在心脏\n[03:08.75]\n[03:09.33]行李箱里装不下我 想去的远方\n[03:15.01]\n[03:15.61]这来的去的给的欠的算一种褒奖\n[03:21.76]风吹草低见惆怅\n[03:23.52]抬头至少还有光\n[03:27.05]\n[03:27.84]把烦恼痛了吞了认了算了\n[03:31.46]不对别人讲\n[03:34.03]\n[03:34.62]谁还没有辜负几段 昂贵的时光\n[03:40.24]\n[03:40.85]若男孩笑了哭了累了\n[03:44.17]说要去流浪\n[03:47.04]留下大人的模样\n[03:48.88]看岁月剑拔弩张\n[03:52.02]\n[03:53.57]总会有个人成为你的远方","url":"http://dl.stream.qqmusic.qq.com/M800000uhMwj387EBp.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001yHQzz2rm3lk.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002WLDmw0vkHtC.html","songid":"002WLDmw0vkHtC","title":"借 (Live)","author":"毛不易","lrc":"[ti:借 (Live)]\n[ar:毛不易]\n[al:明日之子 第11期]\n[by:]\n[offset:0]\n[00:00.21]借 (Live) - 毛不易\n[00:01.63]词：毛不易\n[00:02.67]曲：毛不易\n[00:03.71]编曲：陈思同 byT.Y.Z\n[00:05.03]音乐总监：谭伊哲\n[00:06.72]乐队：TYZ乐队\n[00:06.92]乐队队长：黄竣琮\n[00:07.18]键盘：韩韵/杨猛\n[00:07.44]鼓手：胡宇飞\n[00:07.64]吉他：黄竣琮/Andrew Moore（加拿大）\n[00:08.07]贝斯：Ryan Bradetich（美国）\n[00:08.37]和声：王思思/刘苪嘉/宋豪\n[00:08.80]打击乐：Gman\n[00:08.96]电脑工程：郭丁尘\n[00:09.23]音乐统筹：吕易秋\n[00:10.58]\n[00:13.93]借一盏午夜街头 昏黄灯光\n[00:18.52]\n[00:20.33]照亮那坎坷路上人影一双\n[00:24.82]\n[00:26.73]借一寸三九天里 冽冽暖阳\n[00:31.76]\n[00:33.23]融这茫茫人间刺骨凉\n[00:38.27]\n[00:39.64]借一泓古老河水 九曲回肠\n[00:44.06]\n[00:45.77]带着那摇晃烛火 漂往远方\n[00:50.86]\n[00:52.57]借一段往日旋律 婉转悠扬\n[00:57.44]\n[00:58.76]把这不能说的轻轻唱\n[01:04.06]\n[01:05.29]被这风吹散的人说他爱得不深\n[01:11.86]被这雨淋湿的人说他不会冷\n[01:17.76]无边夜色到底还要蒙住多少人\n[01:24.52]\n[01:25.29]它写进眼里 他不敢承认\n[01:31.16]\n[01:59.13]借一抹临别黄昏悠悠斜阳\n[02:04.46]\n[02:06.28]为这漫漫余生添一道光\n[02:11.21]\n[02:12.30]借一句刻骨铭心来日方长\n[02:17.42]\n[02:18.93]倘若不得不天各一方\n[02:24.89]\n[02:25.70]被这风吹散的人说他爱得不深\n[02:31.34]\n[02:31.88]被这雨淋湿的人说他不会冷\n[02:37.85]无边夜色到底还要蒙住多少人\n[02:44.32]\n[02:45.04]它写进眼里 他不敢承认\n[02:50.83]可是啊 总有那风吹不散的认真\n[02:57.29]总有大雨也不能抹去的泪痕\n[03:03.41]有一天太阳会升起在某个清晨\n[03:09.74]\n[03:10.76]一道彩虹 两个人\n[03:15.57]\n[03:21.39]借一方乐土让他容身\n[03:25.78]\n[03:28.15]借他平凡一生","url":"http://dl.stream.qqmusic.qq.com/M800002WLDmw0vkHtC.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002iBxBy3bAmCx.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/000DltsM4gJHXv.html","songid":"000DltsM4gJHXv","title":"无问","author":"毛不易","lrc":"[ti:无问 (《无问西东》电影宣传曲)]\n[ar:毛不易]\n[al:无问]\n[by:]\n[offset:0]\n[00:00.38]无问 (《无问西东》电影宣传曲) - 毛不易\n[00:01.07]词：毛不易\n[00:01.25]曲：毛不易\n[00:01.43]编曲：刘卓\n[00:01.62]制作人：刘卓\n[00:01.83]混音：周天澈\n[00:02.05]配唱制作人：刘芳\n[00:02.34]弦乐编写：靳锐\n[00:02.60]弦乐录音：国际首席爱乐乐团 首席 李朋\n[00:03.26]\n[00:19.93]你问风为什么托着候鸟飞翔\n[00:25.27]却又吹的让他慌张\n[00:29.17]\n[00:29.69]你问雨为什么滋养万物生长\n[00:35.25]却也湿透他的衣裳\n[00:39.08]\n[00:39.66]你问他为什么亲吻他的伤疤\n[00:45.20]却又不能带他回家\n[00:49.46]\n[00:50.50]你问我为什么还是不敢放下\n[00:55.18]明知听不到回答\n[00:58.91]\n[00:59.87]如果光已忘了要将前方照亮\n[01:04.64]\n[01:05.14]你会握着我的手吗\n[01:09.15]\n[01:10.10]如果路会通往不知名的地方\n[01:15.15]你会跟我一起走吗\n[01:19.56]一生太短 一瞬好长\n[01:24.53]我们哭着醒来 又哭着遗忘\n[01:29.55]\n[01:30.14]幸好啊 你的手曾落在我肩膀\n[01:37.24]\n[01:39.30]就像空中漂浮的\n[01:42.21]渺小的 某颗尘土\n[01:48.44]\n[01:49.88]它到底 为什么 为什么\n[01:54.33]不肯停驻\n[01:58.12]\n[02:00.19]直到乌云散去 风雨落幕\n[02:10.37]他会带你找到 光的来处\n[02:19.03]\n[02:19.63]就像手边落满了\n[02:22.18]灰尘的 某一本书\n[02:28.55]\n[02:29.96]它可曾 单薄地\n[02:32.12]承载了 谁的酸楚\n[02:38.61]\n[02:40.23]尽管岁月无声 流向迟暮\n[02:50.26]他会让你想起 你的归途\n[02:59.47]\n[03:44.95]如果光已忘了要将前方照亮\n[03:50.72]你会握着我的手吗\n[03:54.96]\n[03:55.92]如果路会通往不知名的地方\n[04:01.38]你会跟我一起走吗","url":"http://dl.stream.qqmusic.qq.com/M800000DltsM4gJHXv.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M0000026ttFc17IeE3.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001hwT1w1Izz3y.html","songid":"001hwT1w1Izz3y","title":"盛夏 (Live)","author":"毛不易","lrc":"[ti:盛夏 (Live)]\n[ar:毛不易]\n[al:明日之子 第15期]\n[by:]\n[offset:0]\n[00:00.21]盛夏 (Live) - 毛不易\n[00:01.85]词：毛不易\n[00:02.91]曲：毛不易\n[00:03.90]编曲：迦宁乐社\n[00:05.29]音乐总监：谭伊哲\n[00:06.78]手碟：刘恒\n[00:07.86]乐队：TYZ乐队\n[00:09.09]乐队队长兼吉他手：黄竣琮\n[00:11.14]键盘1：韩韵\n[00:12.29]键盘2：杨猛\n[00:13.44]鼓手：胡宇飞\n[00:14.65]吉他2：Andrew Moore（加拿大）\n[00:16.71]贝斯： Ryan Bradetich（美国）\n[00:18.42]和声：梁古驰/王思思/刘芮嘉\n[00:20.94]打击乐：Gman\n[00:21.97]电脑工程：郭丁尘\n[00:23.55]音乐统筹：吕易秋 by T.Y.Z\n[00:25.37]\n[00:31.49]那是日落时候轻轻发出的叹息吧\n[00:38.52]\n[00:39.19]昨天已经走远了 明天该去哪啊\n[00:45.99]\n[00:46.91]相框里的那些闪闪发光的我们啊\n[00:53.89]\n[00:54.52]在夏天发生的事 你忘了吗\n[00:59.70]\n[01:03.35]铁道旁的老树下 几只乌鸦\n[01:07.52]\n[01:11.08]叫到嗓音沙哑 却再没人回答\n[01:15.45]\n[01:18.75]火车呼啸着驶过 驶过寂寞或繁华\n[01:24.44]\n[01:25.48]曾经年轻的人 也想我吗\n[01:30.61]\n[01:34.64]就回来吧 回来吧 有人在等你啊\n[01:42.00]\n[01:43.30]有人在等你说完那句说一半的话\n[01:50.04]就别走了 留下吧 外面它太复杂\n[01:57.54]\n[01:58.76]多少次让你热泪盈眶却不敢流下\n[02:06.41]\n[02:38.36]铁道旁的老树下 几只乌鸦\n[02:42.36]\n[02:45.90]叫到嗓音沙哑 却再没人回答\n[02:50.75]\n[02:53.62]火车呼啸着驶过 驶过寂寞或繁华\n[02:59.55]\n[03:00.38]曾经年轻的人啊 也会想我吗\n[03:05.73]\n[03:09.33]就回来吧 回来吧 有人在等你啊\n[03:17.03]\n[03:18.09]有人在等你说完那句说一半的话\n[03:24.34]\n[03:24.94]就别走了 留下吧 外面它太复杂\n[03:32.62]\n[03:33.58]多少次让你热泪盈眶却不敢流下\n[03:42.41]\n[03:55.88]可时光啊 不听话 总催着人长大\n[04:03.33]\n[04:04.57]这一站到下一站旅途总是停不下\n[04:11.29]就慢慢的 忘了吧 因为回不去啊\n[04:18.70]\n[04:20.00]那闭上眼睛就拥有了一切的盛夏","url":"http://dl.stream.qqmusic.qq.com/M500001hwT1w1Izz3y.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002YpJrS1ussoD.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/004W5x0Z3k7FIx.html","songid":"004W5x0Z3k7FIx","title":"二零三 (Live)","author":"毛不易","lrc":"[ti:二零三 (Live)]\n[ar:毛不易]\n[al:明日之子 第10期]\n[by:]\n[offset:0]\n[00:01.34]二零三 (Live) - 毛不易\n[00:03.19]词：毛不易\n[00:04.16]曲：毛不易\n[00:05.11]编曲：郑楠\n[00:06.07]音乐总监：谭伊哲\n[00:07.71]乐队：TYZ乐队\n[00:09.48]\n[00:21.44]那天偶然走进你\n[00:25.14]\n[00:26.12]五月南风正和煦\n[00:30.07]也许它的双手太多情\n[00:33.78]\n[00:34.80]让我想留在这里\n[00:38.43]\n[00:39.20]后来刮风又下雨\n[00:42.45]\n[00:43.03]我都躲在你怀里\n[00:46.84]\n[00:47.37]看着我所有的小脾气\n[00:51.63]无论快乐或伤心\n[00:54.86]\n[00:55.40]虽然到现在 还孑然一身\n[00:59.28]\n[00:59.80]你会陪我默默忧愁到凌晨\n[01:03.47]\n[01:04.20]其实你知道 来来往往有多少人\n[01:09.67]只是扬起了灰尘\n[01:12.93]\n[01:13.79]明天我就要远走\n[01:17.47]\n[01:18.31]最后和你挥挥手\n[01:22.13]但你不会哭也不会挽留\n[01:26.83]给我想要的自由\n[01:29.94]\n[01:47.81]虽然到现在 还不太安稳\n[01:51.45]\n[01:52.09]你会为我默默留下一盏灯\n[01:55.73]\n[01:56.48]其实你知道 匆匆忙忙有多少人\n[02:01.10]\n[02:02.04]渐渐丢失了单纯\n[02:05.09]许多年之后 在哪里安身\n[02:09.09]\n[02:09.64]是否还能拥抱这样的温存\n[02:13.73]其实我知道\n[02:15.41]\n[02:16.07]于你而言我只不过是个\n[02:19.44]匆匆而过的旅人\n[02:22.61]其实我知道\n[02:24.75]于你而言我只不过是个\n[02:28.16]匆匆而过的旅人\n[02:31.01]\n[02:48.98]其实我知道\n[02:50.98]于你而言我只不过是个\n[02:54.60]匆匆而过的旅人","url":"http://dl.stream.qqmusic.qq.com/M800004W5x0Z3k7FIx.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001vDRza1ds57l.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0004ieul3S0r2m.html","songid":"0004ieul3S0r2m","title":"项羽虞姬","author":"毛不易","lrc":"[ti:项羽虞姬 (《王者荣耀》项羽虞姬英雄主打歌)]\n[ar:毛不易]\n[al:项羽虞姬]\n[by:]\n[offset:0]\n[00:00.16]项羽虞姬 (《王者荣耀》项羽虞姬英雄主打歌) - 毛不易\n[00:03.63]词：毛不易\n[00:04.29]曲：毛不易\n[00:05.00]编曲：韦伟\n[00:05.71]制作人：韦伟\n[00:06.57]吉他：谢星\n[00:07.33]BASS：王溪\n[00:07.96]鼓：冯俊华\n[00:08.66]和声编写：何文锐\n[00:09.83]和声：何文锐/王笑文\n[00:11.22]古筝：郭安琪\n[00:11.94]二胡：乔祎\n[00:12.52]大提琴：张平\n[00:13.20]键盘：韦伟\n[00:13.86]MIDI：韦伟\n[00:14.44]录音：甄浩/金冠宇/张一白\n[00:16.31]混音：李越\n[00:17.20]母带：李越\n[00:17.78]录音棚：好听音乐55tecstudio中国唱片厂\n[00:19.25]混音棚：大陆桥声音工作室\n[00:21.07]\n[00:22.14]长夜漫漫声声楚歌残\n[00:29.44]\n[00:30.44]草长处月碎大河蓝\n[00:36.42]\n[00:39.07]依稀旧梦幕幕总纠缠\n[00:46.39]\n[00:47.46]不忍看不忍看\n[00:53.34]\n[00:55.33]挥刀斩尽万古愁\n[00:59.47]奈何断水水更流\n[01:03.72]宿命欲催英雄瘦\n[01:07.97]不改天命誓不休\n[01:14.53]\n[01:15.10]再歌一曲哪怕风急雨骤\n[01:22.87]\n[01:23.43]角声阵阵相思写满袖\n[01:31.20]\n[01:31.90]金戈铁马旧烈酒喝不够\n[01:39.68]\n[01:40.38]梦里见你在桥头\n[01:48.24]\n[02:22.73]情生两端绿野水向南\n[02:29.89]\n[02:31.31]林深处岁月不流转\n[02:37.12]\n[02:39.78]倩影青衫弦上月已满\n[02:47.32]\n[02:47.96]风也轻云也淡\n[02:54.22]\n[02:56.17]藤上飞鸟来又走\n[02:59.59]\n[03:00.16]晚钟催红相思豆\n[03:04.31]英雄做刀妾作酒\n[03:08.55]荡尽世间恶与丑\n[03:15.69]涤净苍生直至山明水秀\n[03:23.31]\n[03:24.11]情深意重丝丝不能露\n[03:32.10]\n[03:32.66]金戈铁马旧烈酒喝不够\n[03:40.49]\n[03:41.12]梦里见你在桥头\n[03:49.55]深情不死终有重逢时候\n[03:57.29]\n[03:58.06]湮灭千年不曾放开手\n[04:06.46]再看你眼眸光彩依旧\n[04:14.12]\n[04:14.72]续写那万世千秋","url":"http://dl.stream.qqmusic.qq.com/M8000004ieul3S0r2m.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M0000000yTWL3FDulw.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/003TRP3D18X72i.html","songid":"003TRP3D18X72i","title":"浴火成诗","author":"迪丽热巴,毛不易","lrc":"[ti:浴火成诗 (《烈火如歌》电视剧片尾曲)]\n[ar:迪丽热巴/毛不易]\n[al:浴火成诗]\n[by:]\n[offset:0]\n[00:00.34]浴火成诗 (《烈火如歌》电视剧片尾曲) - 迪丽热巴 (Dilraba Dilmurat)/毛不易\n[00:01.69]词：段思思\n[00:01.86]曲：谭旋\n[00:01.99]编曲：雷立\n[00:02.15]制作人：谭旋\n[00:02.35]吉他：赵勤\n[00:02.52]笛子：张清\n[00:02.68]弦乐团：国际首席爱乐乐团\n[00:03.08]录音师：马涛\n[00:03.28]混音：李卓\n[00:03.44]和声：邱芷玲\n[00:03.64]录音棚：谭旋音乐工作室\n[00:04.00]监制：谭旋\n[00:04.17]出品：上海谭旋音乐工作室\n[00:04.75]\n[00:28.11]女：\n[00:28.64]\n[00:30.88]人常说天涯地角\n[00:33.74]步步有穷时\n[00:36.24]\n[00:36.78]为何穷尽\n[00:38.77]挨不过这相思\n[00:42.33]\n[00:44.50]霜融成字 花开写诗\n[00:51.35]惟我不善这言辞\n[00:57.82]男：\n[00:58.15]谁送我寒冬落魄\n[01:01.25]春暖逢生时\n[01:03.64]\n[01:04.35]一次便作废了生死\n[01:09.85]\n[01:10.92]飞鸿跨雪追日添白丝\n[01:14.94]痛戛然而止\n[01:17.72]\n[01:18.30]爱是指尖生悦的刺\n[01:24.12]女：\n[01:24.41]为我心心念念几个字\n[01:28.68]浅情人不知\n[01:31.72]赴不尽这扑火退羽\n[01:35.45]几成痴\n[01:38.60]男：\n[01:38.83]倘若唯唯诺诺在这弹指\n[01:42.34]怕枉费一世\n[01:45.12]\n[01:45.63]不浴火 不成诗\n[01:51.66]\n[02:21.62]女：\n[02:22.10]\n[02:23.91]人常说天涯地角\n[02:26.96]步步有穷时\n[02:29.44]\n[02:30.01]为何穷尽\n[02:31.90]挨不过这相思\n[02:35.82]\n[02:37.65]霜融成字 花开写诗\n[02:43.70]\n[02:44.55]惟我不善这言辞\n[02:50.47]男：\n[02:50.84]\n[02:51.39]谁送我寒冬落魄\n[02:54.31]春暖逢生时\n[02:57.07]\n[02:57.65]一次便作废了生死\n[03:03.01]\n[03:04.21]飞鸿跨雪追日添白丝\n[03:08.01]痛戛然而止\n[03:10.75]\n[03:11.53]爱是指尖生悦的刺\n[03:17.28]女：\n[03:17.51]为我心心念念几个字\n[03:21.79]浅情人不知\n[03:24.74]赴不尽这扑火退羽\n[03:28.65]几成痴\n[03:31.69]男：\n[03:31.92]倘若唯唯诺诺在这弹指\n[03:35.47]怕枉费一世\n[03:38.28]\n[03:38.96]不浴火 不成诗\n[03:45.05]女：\n[03:45.28]在这颠颠倒倒的乱世\n[03:49.23]浅情人不识\n[03:52.16]看不破这扑火退羽\n[03:56.03]几成痴\n[03:58.35]\n[03:59.16]男：\n[03:59.40]沁于山川湖海燃于笔纸\n[04:02.86]再写你一次\n[04:06.80]\n[04:09.88]不浴火 不成诗\n[04:15.94]\n[04:16.69]不浴火 怎成诗","url":"http://dl.stream.qqmusic.qq.com/M800003TRP3D18X72i.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001AHrkw0iYcyE.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002pSEOv3nvq4m.html","songid":"002pSEOv3nvq4m","title":"如果有一天我变得很有钱 (Live)","author":"天佑,毛不易","lrc":"[ti:如果有一天我变得很有钱 (Live)]\n[ar:MC天佑/毛不易]\n[al:明日之子 第14期]\n[by:]\n[offset:0]\n[00:00.50]如果有一天我变得很有钱 (Live) - 天佑/毛不易\n[00:01.80]词：毛不易/天佑/吕易秋\n[00:02.25]曲：毛不易/天佑\n[00:02.55]编曲：陈思同/黄竣琮 by T.Y.Z\n[00:02.99]音乐总监：谭伊哲\n[00:03.29]合唱团：雪花合唱团\n[00:03.63]乐队：TYZ乐队\n[00:03.85]乐队队长兼吉他手：黄竣琮\n[00:04.30]键盘1：韩韵\n[00:04.53]键盘2：杨猛\n[00:04.75]鼓手：胡宇飞\n[00:04.98]吉他2：Andrew Moore （加拿大）\n[00:05.39]贝斯：Ryan Bradetich（美国）\n[00:05.72]和声：梁古驰/王思思/刘芮嘉\n[00:06.25]打击乐：Gman\n[00:06.44]电脑工程：郭丁尘\n[00:06.73]音乐统筹：吕易秋 by T.Y.Z\n[00:07.40]\n[00:08.36]毛：\n[00:08.98]如果有一天我变得很有钱\n[00:11.77]我的第一选择不是去环游世界\n[00:15.41]躺在世界上最大最软的沙发里\n[00:18.82]吃了就睡醒了再吃先过一年\n[00:22.26]\n[00:22.77]如果有一天我变得很有钱\n[00:25.67]就可以把所有人都留在我身边\n[00:29.40]每天快快乐乐吃吃喝喝聊聊天\n[00:32.74]不用担心关于明天或离别\n[00:36.91]\n[00:37.63]变有钱 我变有钱\n[00:41.50]多少人没日没夜地浪费时间\n[00:44.95]变有钱 我变有钱\n[00:48.07]\n[00:48.70]然后故作谦虚地说金钱不是一切\n[00:52.28]\n[01:09.22]天：\n[01:09.93]自古良君多生悲 江边寒风刺骨吹\n[01:13.74]落魄潦倒志未灰\n[01:15.36]我十年来闯荡衣锦归\n[01:17.43]人生烦恼无穷匮世界那更迭总憔悴\n[01:21.01]平心煮酒千杯不醉\n[01:22.85]笑看了他人错与对\n[01:24.65]劝君莫笑非龙池劝君惜取了少年时\n[01:28.27]阅尽多少是非曲直才知因果总相持\n[01:32.06]壮志未酬谁得见功成了名就成一线\n[01:35.78]艰苦岁月一朝磨炼\n[01:37.52]变为了成功的信念\n[01:39.33]莫欺人穷仍少年谁无那迷途枉流连\n[01:43.02]将军百战终究凯旋\n[01:44.95]我必呈现我狂言\n[01:46.64]他日富贾称一方栉风那沐雨守国疆\n[01:50.32]保我河山护我那家乡\n[01:52.26]外侮岂敢虎作猖\n[01:54.04]\n[01:55.57]毛：\n[01:55.98]\n[01:57.38]如果有一天我变得很有钱\n[02:00.24]我会买下所有难得一见的笑脸\n[02:03.84]让所有可怜的孩子不再胆怯\n[02:07.37]所有邪恶的人不再掌握话语权\n[02:11.38]如果有一天我变得很有钱\n[02:14.24]我会想尽一切办法倒流时间\n[02:17.77]不是为了人类理想做贡献\n[02:21.22]只是想和她说一句我很抱歉\n[02:25.44]\n[02:26.30]变有钱 我变有钱\n[02:29.94]多少人没日没夜地浪费时间\n[02:33.46]变有钱 我变有钱\n[02:36.42]\n[02:37.23]然后故作谦虚地说金钱不是一切\n[02:40.88]\n[02:41.75]我变有钱\n[02:44.00]所有烦恼都被留在天边\n[02:47.32]变有钱 我变有钱\n[02:50.51]\n[02:51.28]然后发自内心地说金钱它不是一切\n[02:55.51]\n[03:01.87]天：\n[03:02.40]如果有天我有钱我先休息了一整年\n[03:06.03]飞机跑车全都买全\n[03:08.10]追回了失去那段缘\n[03:10.05]多挣钱不放弃这场比赛在继续\n[03:13.50]他的歌声如此美丽\n[03:15.53]多多支持那毛不易\n[03:17.09]毛：\n[03:17.42]变有钱 我变有钱\n[03:20.51]天：\n[03:21.15]踏实肯干不偷闲\n[03:22.86]做个有为的好青年\n[03:24.59]毛：\n[03:24.89]变有钱 我变有钱\n[03:27.86]天：\n[03:28.53]初心不改正当年\n[03:30.38]自强自立挣尊严\n[03:32.06]毛：\n[03:32.36]变有钱 我变有钱\n[03:35.27]天：\n[03:36.14]陪在父母的身边\n[03:37.81]撑起了家中的一片天\n[03:39.70]毛：\n[03:40.02]变有钱 我变有钱\n[03:43.08]天：\n[03:43.65]咬紧牙关 继续努力\n[03:45.42]坚持了理想不放弃\n[03:47.96]\n[03:48.65]我想有钱","url":"http://dl.stream.qqmusic.qq.com/M500002pSEOv3nvq4m.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000003TjXuj0UYfm8.jpg"}]
     */

    private int status;
    private List<DataBean> data;

    public int getStatus() {
        return status;
    }

    public void setStatus(int status) {
        this.status = status;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * type : qq
         * link : http://y.qq.com/n/yqq/song/003kLvu04bLGzi.html
         * songid : 003kLvu04bLGzi
         * title : 消愁 (Live)
         * author : 毛不易
         * lrc : [ti:消愁 (Live)]
         [ar:毛不易]
         [al:明日之子 第7期]
         [by:]
         [offset:0]
         [00:00.22]消愁 (Live) - 毛不易
         [00:01.74]词：毛不易
         [00:02.67]曲：毛不易
         [00:03.84]编曲：郑楠
         [00:04.00]音乐总监：谭伊哲
         [00:05.58]乐队：TYZ乐队
         [00:07.11]
         [00:18.19]当你走进这欢乐场
         [00:22.24]背上所有的梦与想
         [00:26.09]
         [00:26.64]各色的脸上各色的妆
         [00:30.95]没人记得你的模样
         [00:35.31]三巡酒过你在角落
         [00:39.71]固执地唱着苦涩的歌
         [00:43.99]听他在喧嚣里被淹没
         [00:48.14]你拿起酒杯对自己说
         [00:52.78]一杯敬朝阳 一杯敬月光
         [00:57.17]唤醒我的向往 温柔了寒窗
         [01:01.17]于是可以不回头地逆风飞翔
         [01:05.84]不怕心头有雨 眼底有霜
         [01:10.36]一杯敬故乡 一杯敬远方
         [01:14.66]守着我的善良 催着我成长
         [01:18.58]所以南北的路从此不再漫长
         [01:23.23]灵魂不再无处安放
         [01:26.83]
         [01:47.69]一杯敬明天 一杯敬过往
         [01:51.81]宽重我的身体 厚重了肩膀
         [01:55.67]虽然从不相信所谓山高水长
         [02:00.39]人生苦短何必念念不忘
         [02:04.77]一杯敬自由 一杯敬死亡
         [02:09.10]宽恕我的平凡 驱散了迷惘
         [02:13.20]好吧天亮之后总是潦草离场
         [02:17.57]清醒的人最荒唐
         [02:21.20]
         [02:21.80]好吧天亮之后总是潦草离场
         [02:26.45]清醒的人最荒唐
         * url : http://dl.stream.qqmusic.qq.com/M800003kLvu04bLGzi.mp3?vkey=7A5C1FECEF2FFD4083E0BE2028AA61BB7D1BA0602DBCBE2C9C20EC64FB86E45CC84C7ECA698FBDDF969874D0F945EAA8D82A9AD502C11896&guid=5150825362&fromtag=1
         * pic : http://y.gtimg.cn/music/photo_new/T002R300x300M000002xoonH2Bk7FR.jpg
         */

        private String type;
        private String link;
        private String songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getSongid() {
            return songid;
        }

        public void setSongid(String songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }
    }
}
